sysbench/sysbench_disk_rndwr.txt
admin@master:~$ mpirun -x LD_LIBRARY_PATH --bind-to core -np 2 --map-by ppr:1:core --hostfile hosts.txt sysbench fileio --threads=2 --file-test-mode=rndwr run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!

sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     442.75
    fsyncs/s:                     591.12

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               6.92

General statistics:
    total time:                          10.1626s
    total number of events:              10252

Latency (ms):
         min:                                    0.00
         avg:                                    1.95
         max:                                  422.41
         95th percentile:                        4.91
         sum:                                19994.82

Threads fairness:
    events (avg/stddev):           5126.0000/495.00
    execution time (avg/stddev):   9.9974/0.00


File operations:
    reads/s:                      0.00
    writes/s:                     442.41
    fsyncs/s:                     590.77

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               6.91

General statistics:
    total time:                          10.1704s
    total number of events:              10253

Latency (ms):
         min:                                    0.00
         avg:                                    1.95
         max:                                  420.48
         95th percentile:                        4.91
         sum:                                19965.09

Threads fairness:
    events (avg/stddev):           5126.5000/0.50
    execution time (avg/stddev):   9.9825/0.00